   - [#   5] AOR datasets.GPT_4.Chain_of_thought.programs.program_023: [0.00000 s] killed by test_boundary_values (datasets.GPT_4.Chain_of_thought.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Chain_of_thought\tests\test_023.py", line 41, in test_boundary_values
    self.assertEqual(comb_sort([2147483647, -2147483648, 0]), [-2147483648, 0, 2147483647])
AssertionError: Lists differ: [2147483647, 0, 0] != [-2147483648, 0, 2147483647]

First differing element 0:
2147483647
-2147483648

- [2147483647, 0, 0]
+ [-2147483648, 0, 2147483647]

   - [#   6] AOR datasets.GPT_4.Chain_of_thought.programs.program_023: [0.00000 s] killed by test_boundary_values (datasets.GPT_4.Chain_of_thought.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Chain_of_thought\tests\test_023.py", line 41, in test_boundary_values
    self.assertEqual(comb_sort([2147483647, -2147483648, 0]), [-2147483648, 0, 2147483647])
AssertionError: Lists differ: [-2147483648, -2147483648, 2147483647] != [-2147483648, 0, 2147483647]

First differing element 1:
-2147483648
0

- [-2147483648, -2147483648, 2147483647]
?               ^^^^^^^^^^^

+ [-2147483648, 0, 2147483647]
?               ^

   - [#   8] COI datasets.GPT_4.Chain_of_thought.programs.program_023: [0.00000 s] killed by test_boundary_values (datasets.GPT_4.Chain_of_thought.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Chain_of_thought\tests\test_023.py", line 41, in test_boundary_values
    self.assertEqual(comb_sort([2147483647, -2147483648, 0]), [-2147483648, 0, 2147483647])
AssertionError: Lists differ: [2147483647, -2147483648, 0] != [-2147483648, 0, 2147483647]

First differing element 0:
2147483647
-2147483648

- [2147483647, -2147483648, 0]
+ [-2147483648, 0, 2147483647]

   - [#  11] LCR datasets.GPT_4.Chain_of_thought.programs.program_023: [0.00000 s] killed by test_floating_point_numbers (datasets.GPT_4.Chain_of_thought.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Chain_of_thought\tests\test_023.py", line 33, in test_floating_point_numbers
    self.assertEqual(comb_sort([1.5, 3.2, 2.1, 4.8, 0.5]), [0.5, 1.5, 2.1, 3.2, 4.8])
AssertionError: Lists differ: [1.5, 0.5, 2.1, 4.8, 3.2] != [0.5, 1.5, 2.1, 3.2, 4.8]

First differing element 0:
1.5
0.5

- [1.5, 0.5, 2.1, 4.8, 3.2]
+ [0.5, 1.5, 2.1, 3.2, 4.8]
