   - [#   1] COI datasets.GPT_4.Chain_of_thought.programs.program_070: [0.00000 s] killed by test_all_words_longer_than_n (datasets.GPT_4.Chain_of_thought.tests.test_070.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Chain_of_thought\tests\test_070.py", line 12, in test_all_words_longer_than_n
    self.assertEqual(long_words(1, 'longer words here'), ['longer', 'words', 'here'])
AssertionError: Lists differ: [] != ['longer', 'words', 'here']

Second list contains 3 additional elements.
First extra element 0:
'longer'

- []
+ ['longer', 'words', 'here']

   - [#   3] ROR datasets.GPT_4.Chain_of_thought.programs.program_070: [0.00000 s] killed by test_exact_length_match (datasets.GPT_4.Chain_of_thought.tests.test_070.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Chain_of_thought\tests\test_070.py", line 15, in test_exact_length_match
    self.assertEqual(long_words(4, 'This is a test'), [])
AssertionError: Lists differ: ['This', 'test'] != []

First list contains 2 additional elements.
First extra element 0:
'This'

- ['This', 'test']
+ []
