   - [#   1] COD datasets.GPT_4.Chain_of_thought.programs.program_080: [0.00000 s] killed by test_all_identical_sublists (datasets.GPT_4.Chain_of_thought.tests.test_080.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Chain_of_thought\tests\test_080.py", line 31, in test_all_identical_sublists
    self.assertEqual(extract_singly([[1, 2], [1, 2], [1, 2]]), [1, 2])
AssertionError: Lists differ: [] != [1, 2]

Second list contains 2 additional elements.
First extra element 0:
1

- []
+ [1, 2]
