   - [#   4] AOR datasets.GPT_4.Chain_of_thought1.programs.program_023: [0.00000 s] killed by test_boolean_values (datasets.GPT_4.Chain_of_thought1.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Chain_of_thought1\tests\test_023.py", line 21, in test_boolean_values
    def test_boolean_values(self): self.assertEqual(comb_sort([True, False, True]), [False, True, True])
AssertionError: Lists differ: [True, False, True] != [False, True, True]

First differing element 0:
True
False

- [True, False, True]
+ [False, True, True]

   - [#   5] AOR datasets.GPT_4.Chain_of_thought1.programs.program_023: [0.00000 s] killed by test_boolean_values (datasets.GPT_4.Chain_of_thought1.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Chain_of_thought1\tests\test_023.py", line 21, in test_boolean_values
    def test_boolean_values(self): self.assertEqual(comb_sort([True, False, True]), [False, True, True])
AssertionError: Lists differ: [False, False, True] != [False, True, True]

First differing element 1:
False
True

- [False, False, True]
?         ^^^^

+ [False, True, True]
?         ^^^

   - [#   6] AOR datasets.GPT_4.Chain_of_thought1.programs.program_023: [0.00000 s] killed by test_boolean_values (datasets.GPT_4.Chain_of_thought1.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Chain_of_thought1\tests\test_023.py", line 21, in test_boolean_values
    def test_boolean_values(self): self.assertEqual(comb_sort([True, False, True]), [False, True, True])
AssertionError: Lists differ: [True, True, True] != [False, True, True]

First differing element 0:
True
False

- [True, True, True]
+ [False, True, True]

   - [#  16] ROR datasets.GPT_4.Chain_of_thought1.programs.program_023: [0.00000 s] killed by test_boolean_values (datasets.GPT_4.Chain_of_thought1.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Chain_of_thought1\tests\test_023.py", line 21, in test_boolean_values
    def test_boolean_values(self): self.assertEqual(comb_sort([True, False, True]), [False, True, True])
AssertionError: Lists differ: [True, True, False] != [False, True, True]

First differing element 0:
True
False

- [True, True, False]
+ [False, True, True]
