   - [#   1] COD datasets.GPT_4.Chain_of_thought1.programs.program_086: [0.00000 s] killed by test_all_removed (datasets.GPT_4.Chain_of_thought1.tests.test_086.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Chain_of_thought1\tests\test_086.py", line 9, in test_all_removed
    def test_all_removed(self): self.assertEqual(remove_elements([1, 2], [1, 2]), [])
AssertionError: Lists differ: [1, 2] != []

First list contains 2 additional elements.
First extra element 0:
1

- [1, 2]
+ []
