   - [#   1] ASR datasets.GPT_4.Chain_of_thought2.programs.program_045: [0.00000 s] killed by test_all_same_elements (datasets.GPT_4.Chain_of_thought2.tests.test_045.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Chain_of_thought2\tests\test_045.py", line 9, in test_all_same_elements
    def test_all_same_elements(self): self.assertEqual(frequency_lists([[5, 5], [5], [5, 5]]), {5: 5})
AssertionError: {5: -3} != {5: 5}
- {5: -3}
?     ^^

+ {5: 5}
?     ^
