   - [#   1] AOD datasets.GPT_4.Chain_of_thought2.programs.program_081: [0.00000 s] killed by test_all_same_elements (datasets.GPT_4.Chain_of_thought2.tests.test_081.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Chain_of_thought2\tests\test_081.py", line 13, in test_all_same_elements
    def test_all_same_elements(self): self.assertEqual(pancake_sort([5, 5, 5, 5]), [5, 5, 5, 5])
AssertionError: Lists differ: [5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5] != [5, 5, 5, 5]

First list contains 21 additional elements.
First extra element 4:
5

- [5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]
+ [5, 5, 5, 5]
