   - [#   4] AOR datasets.GPT_4.Few_shot.programs.program_023: [0.00000 s] killed by test_case_1 (datasets.GPT_4.Few_shot.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Few_shot\tests\test_023.py", line 6, in test_case_1
    self.assertEqual(comb_sort([5, 3, 2, 8, 7]), [2, 3, 5, 7, 8]) # Unsorted list)
AssertionError: Lists differ: [2, 7, 3, 8, 5] != [2, 3, 5, 7, 8]

First differing element 1:
7
3

- [2, 7, 3, 8, 5]
+ [2, 3, 5, 7, 8]

   - [#   5] AOR datasets.GPT_4.Few_shot.programs.program_023: [0.00000 s] killed by test_case_1 (datasets.GPT_4.Few_shot.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Few_shot\tests\test_023.py", line 6, in test_case_1
    self.assertEqual(comb_sort([5, 3, 2, 8, 7]), [2, 3, 5, 7, 8]) # Unsorted list)
AssertionError: Lists differ: [3, 2, 2, 5, 7] != [2, 3, 5, 7, 8]

First differing element 0:
3
2

- [3, 2, 2, 5, 7]
+ [2, 3, 5, 7, 8]

   - [#   6] AOR datasets.GPT_4.Few_shot.programs.program_023: [0.00000 s] killed by test_case_1 (datasets.GPT_4.Few_shot.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Few_shot\tests\test_023.py", line 6, in test_case_1
    self.assertEqual(comb_sort([5, 3, 2, 8, 7]), [2, 3, 5, 7, 8]) # Unsorted list)
AssertionError: Lists differ: [7, 7, 8, 8, 8] != [2, 3, 5, 7, 8]

First differing element 0:
7
2

- [7, 7, 8, 8, 8]
+ [2, 3, 5, 7, 8]

   - [#   8] COI datasets.GPT_4.Few_shot.programs.program_023: [0.00000 s] killed by test_case_1 (datasets.GPT_4.Few_shot.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Few_shot\tests\test_023.py", line 6, in test_case_1
    self.assertEqual(comb_sort([5, 3, 2, 8, 7]), [2, 3, 5, 7, 8]) # Unsorted list)
AssertionError: Lists differ: [5, 3, 2, 8, 7] != [2, 3, 5, 7, 8]

First differing element 0:
5
2

- [5, 3, 2, 8, 7]
+ [2, 3, 5, 7, 8]

   - [#  16] ROR datasets.GPT_4.Few_shot.programs.program_023: [0.00000 s] killed by test_case_1 (datasets.GPT_4.Few_shot.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Few_shot\tests\test_023.py", line 6, in test_case_1
    self.assertEqual(comb_sort([5, 3, 2, 8, 7]), [2, 3, 5, 7, 8]) # Unsorted list)
AssertionError: Lists differ: [8, 7, 5, 3, 2] != [2, 3, 5, 7, 8]

First differing element 0:
8
2

- [8, 7, 5, 3, 2]
+ [2, 3, 5, 7, 8]
