   - [#   1] COD datasets.GPT_4.Few_shot.programs.program_086: [0.00000 s] killed by test_case_1 (datasets.GPT_4.Few_shot.tests.test_086.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Few_shot\tests\test_086.py", line 6, in test_case_1
    self.assertEqual(remove_elements([1, 2, 3, 4], [2, 4]), [1, 3]) # Overlapping elements)
AssertionError: Lists differ: [2, 4] != [1, 3]

First differing element 0:
2
1

- [2, 4]
+ [1, 3]
