   - [#   4] AOR datasets.GPT_4.Few_shot1.programs.program_023: [0.00103 s] killed by test_comb_sort_already_sorted (datasets.GPT_4.Few_shot1.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Few_shot1\tests\test_023.py", line 9, in test_comb_sort_already_sorted
    def test_comb_sort_already_sorted(self): self.assertEqual(comb_sort([1, 2, 3, 4, 5]), [1, 2, 3, 4, 5])
AssertionError: Lists differ: [1, 5, 2, 3, 4] != [1, 2, 3, 4, 5]

First differing element 1:
5
2

- [1, 5, 2, 3, 4]
?     ---

+ [1, 2, 3, 4, 5]
?            +++

   - [#  16] ROR datasets.GPT_4.Few_shot1.programs.program_023: [0.00000 s] killed by test_comb_sort_already_sorted (datasets.GPT_4.Few_shot1.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Few_shot1\tests\test_023.py", line 9, in test_comb_sort_already_sorted
    def test_comb_sort_already_sorted(self): self.assertEqual(comb_sort([1, 2, 3, 4, 5]), [1, 2, 3, 4, 5])
AssertionError: Lists differ: [5, 4, 3, 2, 1] != [1, 2, 3, 4, 5]

First differing element 0:
5
1

- [5, 4, 3, 2, 1]
+ [1, 2, 3, 4, 5]
