   - [#   1] ASR datasets.GPT_4.Few_shot1.programs.program_045: [0.00207 s] killed by test_frequency_lists_basic (datasets.GPT_4.Few_shot1.tests.test_045.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Few_shot1\tests\test_045.py", line 5, in test_frequency_lists_basic
    def test_frequency_lists_basic(self): self.assertEqual(frequency_lists([[1, 2], [2, 3]]), {1: 1, 2: 2, 3: 1})
AssertionError: {1: 1, 2: 0, 3: 1} != {1: 1, 2: 2, 3: 1}
- {1: 1, 2: 0, 3: 1}
?           ^

+ {1: 1, 2: 2, 3: 1}
?           ^
