   - [#   2] AOD datasets.GPT_4.Few_shot1.programs.program_073: [0.00099 s] killed by test_reverse_vowels_mixed_content (datasets.GPT_4.Few_shot1.tests.test_073.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Few_shot1\tests\test_073.py", line 23, in test_reverse_vowels_mixed_content
    def test_reverse_vowels_mixed_content(self): self.assertEqual(reverse_vowels("ThIs Is A tEst"), "ThEs As I tIst")
AssertionError: 'ThEs Is I tIst' != 'ThEs As I tIst'
- ThEs Is I tIst
?       ---
+ ThEs As I tIst
?      +++
