   - [#   1] AOD datasets.GPT_4.Few_shot1.programs.program_081: [0.00101 s] killed by test_pancake_sort_all_same (datasets.GPT_4.Few_shot1.tests.test_081.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Few_shot1\tests\test_081.py", line 17, in test_pancake_sort_all_same
    def test_pancake_sort_all_same(self): self.assertEqual(pancake_sort([4, 4, 4]), [4, 4, 4])
AssertionError: Lists differ: [4, 4, 4, 4, 4, 4, 4, 4, 4] != [4, 4, 4]

First list contains 6 additional elements.
First extra element 3:
4

- [4, 4, 4, 4, 4, 4, 4, 4, 4]
+ [4, 4, 4]

   - [#   2] AOD datasets.GPT_4.Few_shot1.programs.program_081: [0.00104 s] killed by test_pancake_sort_all_same (datasets.GPT_4.Few_shot1.tests.test_081.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Few_shot1\tests\test_081.py", line 17, in test_pancake_sort_all_same
    def test_pancake_sort_all_same(self): self.assertEqual(pancake_sort([4, 4, 4]), [4, 4, 4])
AssertionError: Lists differ: [] != [4, 4, 4]

Second list contains 3 additional elements.
First extra element 0:
4

- []
+ [4, 4, 4]
