   - [#   4] AOR datasets.GPT_4.Few_shot2.programs.program_023: [0.00104 s] killed by test_comb_sort_already_sorted (datasets.GPT_4.Few_shot2.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Few_shot2\tests\test_023.py", line 7, in test_comb_sort_already_sorted
    def test_comb_sort_already_sorted(self): self.assertEqual(comb_sort([1, 2, 3]), [1, 2, 3])
AssertionError: Lists differ: [1, 3, 2] != [1, 2, 3]

First differing element 1:
3
2

- [1, 3, 2]
+ [1, 2, 3]

   - [#   5] AOR datasets.GPT_4.Few_shot2.programs.program_023: [0.00106 s] killed by test_comb_sort_basic (datasets.GPT_4.Few_shot2.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Few_shot2\tests\test_023.py", line 5, in test_comb_sort_basic
    def test_comb_sort_basic(self): self.assertEqual(comb_sort([3, 1, 2]), [1, 2, 3])
AssertionError: Lists differ: [3, 2, 2] != [1, 2, 3]

First differing element 0:
3
1

- [3, 2, 2]
?  ^     ^

+ [1, 2, 3]
?  ^     ^

   - [#   6] AOR datasets.GPT_4.Few_shot2.programs.program_023: [0.00091 s] killed by test_comb_sort_basic (datasets.GPT_4.Few_shot2.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Few_shot2\tests\test_023.py", line 5, in test_comb_sort_basic
    def test_comb_sort_basic(self): self.assertEqual(comb_sort([3, 1, 2]), [1, 2, 3])
AssertionError: Lists differ: [1, 1, 3] != [1, 2, 3]

First differing element 1:
1
2

- [1, 1, 3]
?     ^

+ [1, 2, 3]
?     ^

   - [#   8] COI datasets.GPT_4.Few_shot2.programs.program_023: [0.00099 s] killed by test_comb_sort_basic (datasets.GPT_4.Few_shot2.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Few_shot2\tests\test_023.py", line 5, in test_comb_sort_basic
    def test_comb_sort_basic(self): self.assertEqual(comb_sort([3, 1, 2]), [1, 2, 3])
AssertionError: Lists differ: [3, 1, 2] != [1, 2, 3]

First differing element 0:
3
1

- [3, 1, 2]
+ [1, 2, 3]

   - [#  11] LCR datasets.GPT_4.Few_shot2.programs.program_023: [0.00101 s] killed by test_comb_sort_mixed_numbers (datasets.GPT_4.Few_shot2.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Few_shot2\tests\test_023.py", line 21, in test_comb_sort_mixed_numbers
    def test_comb_sort_mixed_numbers(self): self.assertEqual(comb_sort([3, -1, 0, 5, 2]), [-1, 0, 2, 3, 5])
AssertionError: Lists differ: [3, -1, 0, 5, 2] != [-1, 0, 2, 3, 5]

First differing element 0:
3
-1

- [3, -1, 0, 5, 2]
+ [-1, 0, 2, 3, 5]

   - [#  16] ROR datasets.GPT_4.Few_shot2.programs.program_023: [0.00100 s] killed by test_comb_sort_already_sorted (datasets.GPT_4.Few_shot2.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Few_shot2\tests\test_023.py", line 7, in test_comb_sort_already_sorted
    def test_comb_sort_already_sorted(self): self.assertEqual(comb_sort([1, 2, 3]), [1, 2, 3])
AssertionError: Lists differ: [3, 2, 1] != [1, 2, 3]

First differing element 0:
3
1

- [3, 2, 1]
?  ^     ^

+ [1, 2, 3]
?  ^     ^
