   - [#   2] AOD datasets.GPT_4.Few_shot2.programs.program_073: [0.00510 s] killed by test_reverse_vowels_all_vowels (datasets.GPT_4.Few_shot2.tests.test_073.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Few_shot2\tests\test_073.py", line 11, in test_reverse_vowels_all_vowels
    def test_reverse_vowels_all_vowels(self): self.assertEqual(reverse_vowels('aeiou'), 'uoiea')
AssertionError: 'uaaaa' != 'uoiea'
- uaaaa
+ uoiea
