   - [#   1] AOD datasets.GPT_4.Few_shot2.programs.program_081: [0.00000 s] killed by test_pancake_sort_already_sorted (datasets.GPT_4.Few_shot2.tests.test_081.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Few_shot2\tests\test_081.py", line 7, in test_pancake_sort_already_sorted
    def test_pancake_sort_already_sorted(self): self.assertEqual(pancake_sort([1, 2, 3, 4]), [1, 2, 3, 4])
AssertionError: Lists differ: [4] != [1, 2, 3, 4]

First differing element 0:
4
1

Second list contains 3 additional elements.
First extra element 1:
2

- [4]
+ [1, 2, 3, 4]
