   - [#   4] AOR datasets.o3.programs.program_023: [0.00105 s] killed by test_already_sorted (datasets.o3.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\o3\tests\test_023.py", line 12, in test_already_sorted
    self.assertEqual(comb_sort([1,2,3,4]), [1,2,3,4])
AssertionError: Lists differ: [1, 3, 2, 4] != [1, 2, 3, 4]

First differing element 1:
3
2

- [1, 3, 2, 4]
?        ---

+ [1, 2, 3, 4]
?     +++

   - [#   5] AOR datasets.o3.programs.program_023: [0.00000 s] killed by test_duplicates (datasets.o3.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\o3\tests\test_023.py", line 18, in test_duplicates
    self.assertEqual(comb_sort([3,1,2,3]), [1,2,3,3])
AssertionError: Lists differ: [1, 3, 2, 2] != [1, 2, 3, 3]

First differing element 1:
3
2

- [1, 3, 2, 2]
+ [1, 2, 3, 3]

   - [#   6] AOR datasets.o3.programs.program_023: [0.00000 s] killed by test_duplicates (datasets.o3.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\o3\tests\test_023.py", line 18, in test_duplicates
    self.assertEqual(comb_sort([3,1,2,3]), [1,2,3,3])
AssertionError: Lists differ: [3, 2, 3, 3] != [1, 2, 3, 3]

First differing element 0:
3
1

- [3, 2, 3, 3]
+ [1, 2, 3, 3]

   - [#   8] COI datasets.o3.programs.program_023: [0.00000 s] killed by test_duplicates (datasets.o3.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\o3\tests\test_023.py", line 18, in test_duplicates
    self.assertEqual(comb_sort([3,1,2,3]), [1,2,3,3])
AssertionError: Lists differ: [3, 1, 2, 3] != [1, 2, 3, 3]

First differing element 0:
3
1

- [3, 1, 2, 3]
+ [1, 2, 3, 3]

   - [#  16] ROR datasets.o3.programs.program_023: [0.00100 s] killed by test_already_sorted (datasets.o3.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\o3\tests\test_023.py", line 12, in test_already_sorted
    self.assertEqual(comb_sort([1,2,3,4]), [1,2,3,4])
AssertionError: Lists differ: [4, 3, 2, 1] != [1, 2, 3, 4]

First differing element 0:
4
1

- [4, 3, 2, 1]
+ [1, 2, 3, 4]
