   - [#   1] COD datasets.o3.programs.program_080: [0.00000 s] killed by test_basic_duplicate_removal (datasets.o3.tests.test_080.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\o3\tests\test_080.py", line 7, in test_basic_duplicate_removal
    self.assertEqual(extract_singly(data), [1,2,3,4,5,6])
AssertionError: Lists differ: [] != [1, 2, 3, 4, 5, 6]

Second list contains 6 additional elements.
First extra element 0:
1

- []
+ [1, 2, 3, 4, 5, 6]
