   - [#   1] COD datasets.o3.programs.program_086: [0.01011 s] killed by test_all_elements_removed (datasets.o3.tests.test_086.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\o3\tests\test_086.py", line 12, in test_all_elements_removed
    self.assertEqual(remove_elements([1, 1], [1]), [])
AssertionError: Lists differ: [1, 1] != []

First list contains 2 additional elements.
First extra element 0:
1

- [1, 1]
+ []
