   - [#   1] AOR datasets.o3.programs.program_100: [0.00245 s] killed by test_even_length (datasets.o3.tests.test_100.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\o3\tests\test_100.py", line 9, in test_even_length
    self.assertEqual(odd_values_string("abcdef"), "ace")
AssertionError: 'a' != 'ace'
- a
+ ace
