   - [#   5] AOR datasets.GPT_4.Zero_shot1.programs.program_023: [0.00000 s] killed by test_1 (datasets.GPT_4.Zero_shot1.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Zero_shot1\tests\test_023.py", line 6, in test_1
    self.assertEqual(comb_sort([3, 2, 1]), [1, 2, 3])
AssertionError: Lists differ: [3, 1, 1] != [1, 2, 3]

First differing element 0:
3
1

- [3, 1, 1]
+ [1, 2, 3]

   - [#   6] AOR datasets.GPT_4.Zero_shot1.programs.program_023: [0.00100 s] killed by test_1 (datasets.GPT_4.Zero_shot1.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Zero_shot1\tests\test_023.py", line 6, in test_1
    self.assertEqual(comb_sort([3, 2, 1]), [1, 2, 3])
AssertionError: Lists differ: [2, 2, 3] != [1, 2, 3]

First differing element 0:
2
1

- [2, 2, 3]
+ [1, 2, 3]

   - [#  11] LCR datasets.GPT_4.Zero_shot1.programs.program_023: [0.00200 s] killed by test_2 (datasets.GPT_4.Zero_shot1.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Zero_shot1\tests\test_023.py", line 9, in test_2
    self.assertEqual(comb_sort([4, 5, 4, 5]), [4, 4, 5, 5])
AssertionError: Lists differ: [4, 5, 4, 5] != [4, 4, 5, 5]

First differing element 1:
5
4

- [4, 5, 4, 5]
?        ---

+ [4, 4, 5, 5]
?     +++
