   - [#   1] ASR datasets.GPT_4.Zero_shot1.programs.program_072: [0.00000 s] killed by test_4 (datasets.GPT_4.Zero_shot1.tests.test_072.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Zero_shot1\tests\test_072.py", line 15, in test_4
    self.assertEqual(max_occurrences(["a", "b", "a"]), "a")
AssertionError: 'b' != 'a'
- b
+ a
