   - [#   1] COD datasets.GPT_4.Zero_shot1.programs.program_080: [0.00100 s] killed by test_1 (datasets.GPT_4.Zero_shot1.tests.test_080.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Zero_shot1\tests\test_080.py", line 6, in test_1
    self.assertEqual(extract_singly([[5, 6], [7, 8]]), [5, 6, 7, 8])
AssertionError: Lists differ: [] != [5, 6, 7, 8]

Second list contains 4 additional elements.
First extra element 0:
5

- []
+ [5, 6, 7, 8]
