   - [#   1] AOD datasets.GPT_4.Zero_shot1.programs.program_081: [0.00099 s] killed by test_1 (datasets.GPT_4.Zero_shot1.tests.test_081.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Zero_shot1\tests\test_081.py", line 6, in test_1
    self.assertEqual(pancake_sort([3, 2, 1]), [1, 2, 3])
AssertionError: Lists differ: [3, 2, 2, 1, 3, 2, 1] != [1, 2, 3]

First differing element 0:
3
1

First list contains 4 additional elements.
First extra element 3:
1

- [3, 2, 2, 1, 3, 2, 1]
+ [1, 2, 3]
