   - [#   4] AOR datasets.GPT_4.Zero_shot2.programs.program_023: [0.00000 s] killed by test_comb_1 (datasets.GPT_4.Zero_shot2.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Zero_shot2\tests\test_023.py", line 6, in test_comb_1
    self.assertEqual(comb_sort([3, 1, 2]), [1, 2, 3])
AssertionError: Lists differ: [2, 1, 3] != [1, 2, 3]

First differing element 0:
2
1

- [2, 1, 3]
+ [1, 2, 3]

   - [#  11] LCR datasets.GPT_4.Zero_shot2.programs.program_023: [0.00000 s] killed by test_comb_5 (datasets.GPT_4.Zero_shot2.tests.test_023.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Zero_shot2\tests\test_023.py", line 18, in test_comb_5
    self.assertEqual(comb_sort([-3, -1, -2]), [-3, -2, -1])
AssertionError: Lists differ: [-3, -1, -2] != [-3, -2, -1]

First differing element 1:
-1
-2

- [-3, -1, -2]
+ [-3, -2, -1]
