   - [#   1] AOD datasets.GPT_4.Zero_shot2.programs.program_081: [0.00000 s] killed by test_pancake_1 (datasets.GPT_4.Zero_shot2.tests.test_081.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Zero_shot2\tests\test_081.py", line 6, in test_pancake_1
    self.assertEqual(pancake_sort([1, 2, 3]), [1, 2, 3])
AssertionError: Lists differ: [3] != [1, 2, 3]

First differing element 0:
3
1

Second list contains 2 additional elements.
First extra element 1:
2

- [3]
+ [1, 2, 3]

   - [#   2] AOD datasets.GPT_4.Zero_shot2.programs.program_081: [0.00000 s] killed by test_pancake_1 (datasets.GPT_4.Zero_shot2.tests.test_081.TestVersion)

Traceback (most recent call last):
  File "C:\Users\skaspers\OneDrive - Capgemini\Documents\Prompted Testsuite Analysis\.\datasets\GPT_4\Zero_shot2\tests\test_081.py", line 6, in test_pancake_1
    self.assertEqual(pancake_sort([1, 2, 3]), [1, 2, 3])
AssertionError: Lists differ: [] != [1, 2, 3]

Second list contains 3 additional elements.
First extra element 0:
1

- []
+ [1, 2, 3]
